def area(a, b):
    '''
    Вовращает площадь прямоугольника.

        Параметры:
            a (int): десятичное целое число.
            b (int): десятичное целое число.

        Возвращаемое значение:
            a * b (int): десятичное целое число.
        Пример:
        area(4, 5)  =>  4 * 5 = 20
    '''
    return a * b


def perimeter(a, b):
    '''
    Вовращает периметр прямоугольника.
    
        Параметры:
            a (int): десятичное целое число.
            b (int): десятичное целое число.

        Возвращаемое значение:
            a*2 + b*2 (int): десятичное целое число.
        Пример:
        perimeter(4, 5)  =>  4*2 + 5*2 = 26
    '''
    return a*2 + b*2
