def area(a, b):
    '''
    Вовращает площадь прямоугольника.

        Параметры:
            a (int): десятичное целое число.
            b (int): десятичное целое число.

        Возвращаемое значение:
            a * b (int): десятичное целое число.

    '''
    return a * b


def perimeter(a, b):
    '''
        Вовращает периметр прямоугольника.

            Параметры:
                a (int): десятичное целое число.
                b (int): десятичное целое число.

            Возвращаемое значение:
                a*2 + b*2 (int): десятичное целое число.

        '''
    return a*2 + b*2
