
def area(a):
    '''
    Вовращает площадь квадрата.

        Параметры:
            a (int): десятичное целое число.

        Возвращаемое значение:
            a * a (int): десятичное целое число.
        Пример:
        area(3)  =>  3 * 3 = 9
    '''
    return a * a


def perimeter(a):
    '''
    Вовращает периметр квадрата.

        Параметры:
            a (int): десятичное целое число.

        Возвращаемое значение:
            4 * a (int): десятичное целое число.
        Пример:
        perimeter(3)  =>  4 * 3 = 12
    '''
    return 4 * a
