def area(a, h):
    '''
    Вовращает площадь треугольника.

        Параметры:
            a (int): десятичное целое число.
            h (int): десятичное целое число.

        Возвращаемое значение:
            a * h / 2 (float): десятичное число.

    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Вовращает периметр треугольника.

        Параметры:
            a (int): десятичное целое число.
            b (int): десятичное целое число.
            c (int): десятичное целое число.

        Возвращаемое значение:
            a + b + c (int): десятичное целое число.

    '''
    return a + b + c
